kb1c/src/Catalogs/КомментарииБазыЗнаний/КомментарииБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомментарииБазыЗнаний</name>
  <owners>Catalog.СтатьиБазыЗнаний</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАвтор</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </attributes>
</mdclass:Catalog>

kb1c/src/Catalogs/КомментарииБазыЗнаний/Forms/ФормаРедактирования/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если Объект.Период = Дата(1, 1, 1) Тогда
		Объект.Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Элементы.Автор.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Автор);
	
	Если ЗначениеЗаполнено(Параметры.Родитель) Тогда
		ЭтотОбъект.Родитель = Параметры.Родитель;
	Иначе 
		ЭтотОбъект.Родитель = Справочники.КомментарииБазыЗнаний.ПолучитьЗначениеРодитель(Объект.Ссылка);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Родитель, "Автор, Период, Текст");
		
		ЭтотОбъект.АвторСообщения	= СтруктураРеквизитов.Автор;
		ЭтотОбъект.ТекстСообщения	= СтруктураРеквизитов.Текст;
		ЭтотОбъект.ПериодСообщения	= СтруктураРеквизитов.Период;
	КонецЕсли;
	
	Элементы.ГруппаВОтветНаСообщение.Видимость = ЗначениеЗаполнено(ЭтотОбъект.Родитель);
	
	ФорматированныйДокумент.УстановитьHTML(Объект.ТекстHTML, Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ФорматированныйДокумент.ПолучитьHTML(Объект.ТекстHTML, Новый Структура);
	Объект.Текст = ФорматированныйДокумент.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.РодительСсылка = ЭтотОбъект.Родитель;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
